1. jvm이란 무엇이고 사용하는 이유는 무엇인가?

2. jit 컴파일러가 무엇이고 어떻게 동작하는가?

3. .java 파일이 실행되는 과정을 설명하시오.

4. 변수의 종류에는 인스턴스 변수,클래스 변수, 지역 변수가 있다. 각 변수의 스코프와 라이프 타임에 대해 설명하시오.

5. 타입 프로모션과 캐스팅에 대해 설명하시오.

6. 프리미티브 타입과 레퍼런스 타입에 대해 간단히 설명하시오.

7. 시스템 콜이란?

8. 콘텍스트 스위칭이 일어나는 상황과 과정을 설명하시오. (Process p1과 Process p2가 있다고 가정)

9. 교착상태가 발생하는 4가지 필요 충분 조건이 있다. 빈칸을 채우시오.
        : 하나의 공유 자원에 하나의 프로세스만 접근 가능하다.
        : 프로세스가 최소 하나의 자원을 점유하고 있는 상태에서 추가로 다른 프로세스에서 사용 중인 자원을 점유하기 위해 대기한다.
        : 다른 프로세스에 할당된 자원을 뺏을 수 없다.
        : 각 프로세스는 순환적으로 다음 프로세스가 요구하는 자원을 가지고 있다.

10. 경쟁상태를 해결할 수 있는 방법 2가지는 무엇인가?